<?php
    $this->title = '关于本站、等级分和规则';
?>
<div class="about_content">
    <a name="rank" id="rank"></a>
    <h3>等级分：</h3>
    <p>等级分采用<a href="http://zh.wikipedia.org/zh/%E7%AD%89%E7%BA%A7%E5%88%86" target="_blank">ELO等级分算法</a>，想了解具体细节请询问本人。以后可能会开有禁手和无禁手两种等级分。</p>
    <p>初始等级分为2100。暂时没有段级位或者称号的区别。</p>
    <a name="yamaguchi" id="yamaguchi"></a>
    <h3>山口（Yamaguchi）规则：</h3>
        <p>1.先手方下3个棋子（黑1，白2，黑3），同时指定第五手的打点数量N；</p>
        <p>2.后手方可以选择执白或者执黑。</p>
        <p>3.白方下第四手；</p>
        <p>4.黑方按照约定的五手打点数量放上N个棋子，白方指定其中的一个为实战的第五手，然后白方下第六手；</p>
        <p>5.双方轮流行棋。</p>
        <p>注意：先手方的开局仅限26种开局。</p>
    <a name="rif" id="rif"></a>
    <h3>RIF规则：</h3>
    <p>与山口规则类似，不同的是，第五手打点数量固定为2。</p>
    <a name="soosyrv8" id="soosyrv8"></a>
    <h3>索索夫8规则：</h3>
        <p>1.先手方下3个棋子（黑1，白2，黑3，26种开局）；</p>
        <p>2.后手方可以选择执白或者执黑。</p>
        <p>3.白方下第四手，同时指定第五手的打点数量N（N<=8）；</p>
        <p>4.黑方可以选择交换，或者按照约定的五手打点数量放上N个棋子，白方指定其中的一个为实战的第五手，然后白方下第六手；</p>
        <p>5.双方轮流行棋。</p>
    <a name="gomoku" id="gomoku"></a>
    <h3>无禁手规则：</h3>
        <p>双方轮流行棋。黑白双方均无限制，先5为胜，超过6个不产生胜负。</p>
    <a name="freeopen" id="freeopen"></a>
    <h3>自由开局：</h3>
    <p>在以上规则的基础上，你可以勾选此选项，不受26种开局的限制。</p>
</div>