<?php
namespace common\components;


#棋盘 15*15
#看最后一手
#如果是pass 则看是否第二次pass，连续2次pass则和棋。 如不是则返回-1
#结果：
# 若有连5，连当前落子方获胜
# 否则 如果是白棋，则返回-1
#      如果是黑棋，则检查禁手
#         如果有长连，则对方胜利
#         如果有2个或更多活三 ，则对方胜利
#         如果有2个或者更多活四/ 冲四 则对方胜利
#      并没有产生禁手，则返回-1

# 禁手判断：
# 长连： 数。。。
# 判断四： 当前坐标先放个黑棋，然后向某个方向（一共8个方向）寻找空格，找到空格则判断 此处落子是否连5. 如果连5则算一个4.
# 8个方向： x+,y=   x-,y=  | x+,y+   x-,y- | x=,y+   x=,y-  |  x+,y-  x-,y+  ，这玩意回头得封装一下啊
# 判断活四： 当前坐标先放个黑棋，然后指定方向检查，2头都能连5  就是活四（或者同一条线上的双4，用$nLine算法没问题）
# 判断双四：  四个方向遍历， 如果是 活四判断时发现同一条线上的双4 返回true   否则 如果是4则 +1   只要大于2就是双4了
# 判断活三： 八个方向找空格， 落子是否形成活4而且不是禁手   如果活四且不是禁手，那么这就是个活三。
# 判断双活三   ： 每个方向检测，把活三数量加起来。

class BoardHelper
{
    const BOARDSIZE = 15;
    const EMPTY_STONE = '.';
    const BLACK_STONE = '*';
    const WHITE_STONE = '0';

    /**
     * @var array 方向可能有点反直觉， 前一位是行号，最上面是1 最下面是15
     * 后一位是列。
     */
    private static $directions = [
        [+1,0],[-1,0],   //下，上
        [0,+1],[0,-1],   //前，后
        [+1,+1],[-1,-1], //右下，左上
        [+1,-1],[-1,+1], //左下，右上
    ];
    /**
     * @var array 二维数组，保存棋盘。
     *
     */
    private $board = [];
    /**
     * @var array 当前坐标
     */
    private $current = [1,1];



    public function __construct($init = '')
    {
        $this->board = [//初始化，也不要做什么循环了，这样干净。。。也更直观
            ['$','$','$','$','$','$','$','$','$','$','$','$','$','$','$',],//board
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//1
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//2
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//3
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//4
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//5
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//6
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//7
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//8
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//9
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//10
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//11
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//12
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//13
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//14
            ['$','.','.','.','.','.','.','.','.','.','.','.','.','.','$',],//15
            ['$','$','$','$','$','$','$','$','$','$','$','$','$','$','$',],//board
        ];
    }

}